rtek1000/Datalogger_2039/Software/Datalogger_2039 - STM32/Datalogger2039_ADC_Test/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */
/*
 #ifndef UsrLog
 #define  UsrLog(...)   do { \
} while (0)
 #endif
 */

/**/
#ifndef UsrLog
#define  UsrLog(...)   do { \
		printf(__VA_ARGS__); \
		printf("\n"); \
 } while (0)
#endif
/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BUZZER_Pin GPIO_PIN_2
#define BUZZER_GPIO_Port GPIOE
#define DC_DC_ON_Pin GPIO_PIN_3
#define DC_DC_ON_GPIO_Port GPIOE
#define ADC_VBAT_Pin GPIO_PIN_0
#define ADC_VBAT_GPIO_Port GPIOA
#define ADC_CHARGER_Pin GPIO_PIN_3
#define ADC_CHARGER_GPIO_Port GPIOA
#define ADC_DC_DC_5V_Pin GPIO_PIN_4
#define ADC_DC_DC_5V_GPIO_Port GPIOA
#define CHARGER_STATE_Pin GPIO_PIN_5
#define CHARGER_STATE_GPIO_Port GPIOA
#define CHARGER_STATE_EXTI_IRQn EXTI9_5_IRQn
#define ADC_VREF_Pin GPIO_PIN_6
#define ADC_VREF_GPIO_Port GPIOA
#define LCD_BACK_PWM_Pin GPIO_PIN_6
#define LCD_BACK_PWM_GPIO_Port GPIOC
#define UC_PWR_Pin GPIO_PIN_2
#define UC_PWR_GPIO_Port GPIOD
#define LCD_PWR_Pin GPIO_PIN_4
#define LCD_PWR_GPIO_Port GPIOD
#define LED2_Pin GPIO_PIN_0
#define LED2_GPIO_Port GPIOE
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
